In [1]:
import pandas as pd
import numpy as np

In [4]:
# Series
# DataFrames

cosa1 = (5 + 2) * 3
cosa2 = (5,)
cosa3 = (5-3)/4
cosa4 = 8, 9, "hola", 6
cosa5= (((5-2) * (3+5))-3 ) ** 2

In [6]:
s1 = pd.Series([100,200,300,400])
s1

0    100
1    200
2    300
3    400
dtype: int64

In [12]:
def my_operations(x, number1, number2=2):
    return x**2 + number1 - number2

s1.apply(my_operations, args = (5,))

0     10003
1     40003
2     90003
3    160003
dtype: int64

In [14]:
def string_info(x):
    return f"{x} tiene {len(x)} caracteres"

s2 = pd.Series(["hola", "adiós", "lalala"])
s2.apply(string_info)

0      hola tiene 4 caracteres
1     adiós tiene 5 caracteres
2    lalala tiene 6 caracteres
dtype: object

In [17]:
s2 = pd.Series(["hola", "adiós", "lalala"])
s2.apply(str.upper)

0      HOLA
1     ADIÓS
2    LALALA
dtype: object

In [18]:
s2 = pd.Series(["hola", "adiós", "lalala"])
s2.str.upper()

0      HOLA
1     ADIÓS
2    LALALA
dtype: object

In [19]:
def greater_than5(x):
    if x > 5:
        return True
    else:
        return False

In [22]:
greater_than5(10)

True

In [23]:
greater_than5_vectorized = np.vectorize(greater_than5)

In [26]:
s1

0    100
1    200
2    300
3    400
dtype: int64

In [27]:
greater_than5_vectorized(s1)

array([ True,  True,  True,  True])

In [36]:
s3 = pd.Series(["2024-01-02", "2024-04-06"])
s3 = pd.to_datetime(s3)
s3

0   2024-01-02
1   2024-04-06
dtype: datetime64[ns]

In [39]:
s3.dt.day

0    2
1    6
dtype: int32

In [41]:
s3.dt.day_name()

0     Tuesday
1    Saturday
dtype: object

In [42]:
s4 = pd.Series([2,3,4,5,6,7])
s4

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [45]:
s4.apply(lambda x: x**2 +  3* x -1 if x < 5 else x**2)

0     9
1    17
2    27
3    25
4    36
5    49
dtype: int64

In [47]:
mi_suma = lambda x, y, z : (x + y + z, x)
mi_suma(2,3,4)

(9, 2)

In [54]:
s1_nueva = s1.map(lambda x: x+1)
s1_nueva

0    101
1    201
2    301
3    401
dtype: int64

In [56]:
s1

0    100
1    200
2    300
3    400
dtype: int64

In [64]:
s5 = pd.Series([1,2,3,4,5])
s5

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [67]:
s5.agg("mean")

3.0

In [79]:
def mi_agregacion(x):
    return sum(x)

 
s5.agg(["mean", pd.Series.max, "max", mi_agregacion])

mean              3.0
max               5.0
max               5.0
mi_agregacion    15.0
dtype: float64

In [86]:
s5.transform(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
dtype: float64

In [87]:
s5.transform(type)

0    <class 'int'>
1    <class 'int'>
2    <class 'int'>
3    <class 'int'>
4    <class 'int'>
dtype: object

In [89]:
# DataFrames
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [94]:
df.apply(lambda x: [1, 2], axis=1)


#df.apply(lambda x: [1, 2], axis=1, result_type='expand')

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [95]:
df.apply(lambda x: [1, 2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

In [100]:
df.apply(lambda x: x**2)

    A   B
0  16  81
1  16  81
2  16  81

In [102]:
df['otra'] = [3,5,7]
df

   A  B  otra
0  4  9     3
1  4  9     5
2  4  9     7

In [110]:
range(len(df))

range(0, 3)

In [112]:
df_grande = pd.concat([df,df,df], axis=0)
df_grande['A'] = range(len(df_grande))
df_grande

   A  B  otra
0  0  9     3
1  1  9     5
2  2  9     7
0  3  9     3
1  4  9     5
2  5  9     7
0  6  9     3
1  7  9     5
2  8  9     7

In [130]:
df_grande['otra2'] = ['c', 'c', 'c', 'c', 'c', 'c', 'b', 'b','b']
df_grande

   A  B  otra otra2
0  0  9     3     c
1  1  9     5     c
2  2  9     7     c
0  3  9     3     c
1  4  9     5     c
2  5  9     7     c
0  6  9     3     b
1  7  9     5     b
2  8  9     7     b

In [134]:
df_grande.groupby(["otra2"]).apply("max")

       A  B  otra
otra2
b      8  9     7
c      5  9     7

In [142]:
del df_grande['otra']

In [151]:
df_grande

   A  B otra2
0  0  9     c
1  1  9     c
2  2  9     c
0  3  9     c
1  4  9     c
2  5  9     c
0  6  9     b
1  7  9     b
2  8  9     b

In [150]:
df_grande.groupby(["otra2"]).transform(lambda x: x - x.mean())

     A    B
0 -2.5  0.0
1 -1.5  0.0
2 -0.5  0.0
0  0.5  0.0
1  1.5  0.0
2  2.5  0.0
0 -1.0  0.0
1  0.0  0.0
2  1.0  0.0

In [ ]:
df_grande.groupby()

In [5]:
for (indice, valor) in enumerate(["hola", "adiós"]):
    print(indice, valor)

0 hola
1 adiós

In [3]:
type(cosa4)

int